{"case_number":"2025-cv-01542 ","title":"Sony Interactive Entertainment LLC v. The Partnerships and Unincorporated Associations Identified On Schedule A","release_time":"日期：02/13/2025","court":"伊利诺伊州北区法院","brand":"PlayStation系列商标","law_firm":"GBC","progress":[],"full_timelines":[{"date":"08/04/2025","description":"MINUTE entry before the Honorable April M. Perry: Notice of Voluntary Dismissal [26] is acknowledged. Pursuant to Rule 41(a)(1) of the Federal Rules of Civil Procedure, this case is dismissed without prejudice. Any or all previously set deadlines/hearings to be struck. Civil case terminated. Mailed notice. (jcc,)"},{"date":"08/01/2025","description":"NOTICE of Voluntary Dismissal by Sony Interactive Entertainment LLC as to HBNFAO and the Individuals and Entities Operating HBNFAO"},{"date":"07/15/2025","description":"SUMMONS Returned Executed by Sony Interactive Entertainment LLC as to HBNFAO on 7/15/2025, answer due 8/5/2025; The Individuals and Entities Operating HBNFAO on 7/15/2025, answer due 8/5/2025."},{"date":"05/22/2025","description":"SUMMONS Issued (Court Participant) as to Defendant The Individuals and Entities Operating HBNFAO"},{"date":"05/21/2025","description":"SUMMONS Submitted (Court Participant) for defendant(s) HBNFAO and THE INDIVIDUALS AND ENTITIES OPERATING HBNFAO by Plaintiff Sony Interactive Entertainment LLC"},{"date":"05/19/2025","description":"ORDER for Leave to Conduct Expedited Discovery and Service of Process by E-Mail and/or Electronic Publication. Signed by the Honorable April M. Perry on 5/19/2025. Mailed notice. (jcc,)"},{"date":"05/19/2025","description":"MINUTE entry before the Honorable April M. Perry: Plaintiff’s Motions for Expedited Discovery [16] and Electronic Service [17] are granted. Expedited discovery is warranted to identify Defendant. Electronic service of process does not violate any treaty and is consistent with due process because it is an effective way to communicate with an online marketplace defendant. The Court strikes the motion hearing set for 5/20/2025. Enter order. Mailed notice. (jcc,)"},{"date":"05/15/2025","description":"NOTICE of Motion by Justin R. Gaudio for presentment of motion for discovery[16], motion for miscellaneous relief[17] before Honorable April M. Perry on 5/20/2025 at 10:00 AM."},{"date":"05/15/2025","description":"DECLARATION of Justin R. Gaudio regarding memorandum in support of motion[18]"},{"date":"05/15/2025","description":"MEMORANDUM by Sony Interactive Entertainment LLC in support of motion for miscellaneous relief[17]"},{"date":"05/15/2025","description":"MOTION by Plaintiff Sony Interactive Entertainment LLC for Electronic Service of Process Pursuant to Fed. R. Civ. P. 4(f)(3)"},{"date":"05/15/2025","description":"MOTION by Plaintiff Sony Interactive Entertainment LLC for discovery (Expedited)"},{"date":"02/14/2025","description":"EXHIBIT by Plaintiff Sony Interactive Entertainment LLC Amended Schedule A regarding amended complaint, 14"},{"date":"02/14/2025","description":"AMENDED complaint by Sony Interactive Entertainment LLC against HBNFAO, The Individuals and Entities Operating HBNFAO and terminating The Partnerships and Unincorporated Associations Identified on Schedule A"},{"date":"02/14/2025","description":"MINUTE entry before the Honorable April M. Perry: Plaintiff’s Motion to Seal 3 is granted. It appearing that the case filed is a \"Schedule A\" case, the Plaintiff is directed to the Court’s standing order on its website directing the filing of the Court’s Schedule A Template within 14 days. Upon review of the complaint, the Court sua sponte raises the propriety under Federal Rule of Civil Procedure 20(a)(2) of joining 86 defendants to this action. Plaintiff should reference this Court’s opinion in Zaful v. Schedule A Defs., 24-cv-11111, Doc. 12 (N.D. Ill. Jan. 10, 2025), where the Court expressed its views on joinder in Schedule A cases. By 2/28/2025, the plaintiff must file a supplemental memorandum addressing the propriety of joining each and every defendant in light of the principles described in Zaful. In the alternative, plaintiff has leave to file an amended complaint by 2/28/2025 with a smaller subset of defendants along with a memorandum explaining why each defendant is properly joined to all of the others. Mailed notice. (jcc,)"},{"date":"02/14/2025","description":"EMAILED to plaintiff(s) counsel Lanham Mediation Program materials"},{"date":"02/14/2025","description":"EMAILED Trademark report to Patent Trademark Office, Alexandria VA"},{"date":"02/13/2025","description":"CLERK’S NOTICE: Pursuant to Local Rule 73.1(b), a United States Magistrate Judge of this court is available to conduct all proceedings in this civil action. If all parties consent to have the currently assigned United States Magistrate Judge conduct all proceedings in this case, including trial, the entry of final judgment, and all post-trial proceedings, all parties must sign their names on the attached Consent To form. This consent form is eligible for filing only if executed by all parties. The parties can also express their consent to jurisdiction by a magistrate judge in any joint filing, including the Joint Initial Status Report or proposed Case Management Order."},{"date":"02/13/2025","description":"CASE ASSIGNED to the Honorable April M. Perry. Designated as Magistrate Judge the Honorable Keri L. Holleb Hotaling. Case assignment: Random assignment. (Civil Category 2)."},{"date":"02/13/2025","description":"ATTORNEY Appearance for Plaintiff Sony Interactive Entertainment LLC by Lucas Allen Peterson"},{"date":"02/13/2025","description":"ATTORNEY Appearance for Plaintiff Sony Interactive Entertainment LLC by Rachel S Miller"},{"date":"02/13/2025","description":"ATTORNEY Appearance for Plaintiff Sony Interactive Entertainment LLC by Amy Crout Ziegler"},{"date":"02/13/2025","description":"ATTORNEY Appearance for Plaintiff Sony Interactive Entertainment LLC by Justin R. Gaudio"},{"date":"02/13/2025","description":"Notice of Claims Involving Trademarks by Sony Interactive Entertainment LLC"},{"date":"02/13/2025","description":"NOTIFICATION of Affiliates pursuant to Local Rule 3.2 by Sony Interactive Entertainment LLC"},{"date":"02/13/2025","description":"CIVIL Cover Sheet"},{"date":"02/13/2025","description":"MOTION by Plaintiff Sony Interactive Entertainment LLC for leave to file under seal"},{"date":"02/13/2025","description":"SEALED EXHIBIT by Plaintiff Sony Interactive Entertainment LLC Schedule A regarding complaint[1]"},{"date":"02/13/2025","description":"COMPLAINT filed by Sony Interactive Entertainment LLC; Filing fee $ 405, receipt number AILNDC-23082317."}],"origin_article_id":"https://61tro.com/detail/5515.html","_type":"Tro61TROItem"}